{
    "Project": "Project",
    "New Window": "Nieuw Venster",
    "New Project": "Nieuw Project",
    "Open Project": "Open Project",
    "Open Recent": "Open Recent",
    "Clear Recently Opened": "Wis Recent Geopened",
    "Open Backup": "Open Backup",
    "Open Backups Folder": "Open Backups Map",
    "Save": "Opslaan",
    "Save As": "Opslaan Als",
    "Close Project": "Sluit Project",
    "Close Window": "Sluit Venster",
    "Exit": "Sluiten",
    "Selection": "Selectie",
    "Invert": "Omkeren",
    "Undo": "Ongedaan Maken",
    "Redo": "Herhalen",
    "Copy": "Kopiëren",
    "Paste": "Plakken",
    "Bot": "Bot",
    "Start Bot": "Start Bot",
    "Generate Bot Invite": "Genereer Bot Uitnodiging",
    "Set Bot Token": "Zet Bot Token",
    "Set Bot Intents": "Zet Bot Intents",
    "Update bot.js": "Update bot.js",
    "Import Blocks": "Importeer blokken",
    "Default Blocks": "Standaard blokken",
    "Download Blocks": "Download blokken",
    "DBB Community Blocks": "DBB Community Blokken",
    "Refresh Blocks": "Herlaad Blokken",
    "Open Bot Folder": "Open Bot Map",
    "Developer": "Ontwikkelaar",
    "Show CSS Selector": "Laat CSS Selector zien",
    "Refresh Themes": "Herlaad Thema's",
    "Help": "Help",
    "Join our Discord Server": "Sluit je aan bij onze Discord Server",
    "DBB Community Documentation": "DBB Community Documentatie",
    "Download Node.js®": "Download Node.js®",
    "About": "About",
    "(empty)": "(leeg)",

    "Home": "Home",
    "App Settings": "App Instellingen",

    "Recent": "Recent",
    "Clear All": "Alles wissen",
    "What's New": "Wat is nieuw",
    "Show More": "Meer weergeven",

    "Search": "Opzoeken",
    "Create Workspace": "Nieuwe Werkruimte",
    "ON": "AAN",
    "OFF": "UIT",

    "Workspace Info": "Werkruimte Info",

    "Show Item Properties": "Toon Item eigenschappen",
    "Hide Item Properties": "Verstop Item eigenschappen",

    "Select All": "Selecteer Alles",
    "Unselect %d Item(s)": "Deselecteer %d Item(s)",
    "There is no workspace open...": "Er is geen Werkruimte te openen...",
    "To create an Item (Block/Note), right-click and select the desired option.\n\nClick the header of any Item to edit its properties.\n\nHold down Shift and drag a Selection Area.": "Om een Item (Blok/notitie) te maken, klik met je rechtermuis knop en selecteer wat je wil.\n\nKlik de titel van een Item om zijn eigenschappen te veranderen.\n\nHoud Shift ingedrukt en sleep om een selectiegebied te maken.",
    "Height": "Hoogte",
    "Width": "Breedte",
    "Color": "Kleur",
    "Title": "Titel",
    "Description": "Beschrijving",
    "Delete": "Verwijder",

    "Change Banner": "Wijzig Banner",
    "Change Color": "Wijzig Kleur",
    "Turn Workspace ON/OFF": "Zet Werkruimte AAN/UIT",
    "Copy Workspace Data": "Kopieer Werkruimte Data",
    "Paste Workspace Data": "Plak Werkruimte Data",
    "Copy Workspace ID": "Kopieer Werkruimte ID",
    "Copied!": "Gekopieerd!",
    "Delete Workspace": "Verwijder Werkruimte",
    "Open Workspace": "Open Werkruimte",
    "Note": "Notitie",
    "Click to add a note": "Klik om een notitie toe te voegen",

    "Search...": "Zoeken...",
    "Click the Block to add or hover it to preview": "Klik op het blok om het toe te voegen of plaats de muisaanwijzer erop om een ​​voorbeeld te bekijken",
    "No blocks available...": "Geen blokken beschikbaar...",
    "Create Note": "Nieuwe Notitie",
    "Helps to document and organize the blocks within it.": "Helpt bij het documenteren en ordenen van de blokken erin.",

    "Rename Block": "Hernoem Block",
    "Block Name": "Block Naam",
    "New block name": "Nieuwe Block Naam",
    "Be careful when renaming it, it may result in the loss of all block data!": "Wees voorzichtig bij het hernoemen, dit kan resulteren in het verlies van alle Block-gegevens!",
    "Change Bot Token": "Wijzig Bot Token",
    "Bot Token": "Bot Token",
    "New bot token": "Nieuwe Bot Token",
    "Check https://discord.com/developers/applications": "Bekijk https://discord.com/developers/applications",
    "Change Bot Intents": "Wijzig Bot Intents",
    "Bot Intents": "Bot Intents",
    "New bot intents": "Nieuwe Bot Intents",
    "Type **ALL_PRIVILEGED_INTENTS** if you want all intents (you have to enable all the bot's privileged intents in your [Discord Developer Portal](https://discord.com/developers/applications)).\nType **ALL_INTENTS** if you want no privileged intents (some blocks may not work).\nLeave blank if you want no intents (more blocks may not work).": "Typ **ALL_PRIVILEGED_INTENTS** als je alle 'intents' wilt (je moet alle 'privileged intents' aanzetten in [Discord Developer Portal](https://discord.com/developers/applications) hiervoor).\nTyp **ALL_INTENTS** als je geen 'privileged intents' wilt (Sommige Blocks werken mogelijk niet).\nLaat dit veld leeg als u geen intents wilt (meerdere Blocks gaan niet werken).",
    "Image URL": "Foto URL",
    "URL": "URL",
    "Download Block(s)": "Download blok(ken)",
    "Block(s) URL": "Blok(ken) URL",
    "URL (the remote file must be .js or .zip)": "URL (Het bestand moet een .js of .zip zijn)",
    "Import the block(s) remotely, providing the URL ending with .zip for several blocks or .js for just one block.": "Importeer de blok(ken) met URL. URL moet eindigen met .zip voor meerdere blokken of .js voor een.",
    "Cancel": "Annuleren",
    "Change": "Wijzig",
    "Rename": "Hernoemen",

    "Are you sure you want to delete the \"%s\" workspace?": "Weet je zeker dat je de werkruimte \"%s\" wilt verwijderen?",
    "Are you sure you want to paste here the new workspace data?": "Weet je zeker dat je de werkruimte data hier wilt plakken?",
    "You cannot undo this action.": "Je kan deze actie niet ongedaan maken.",
    "If you need help, please join our Discord server.": "Als je hulp nodig hebt, neem dan deel aan onze Discord Server",
    "An error occured while opening project": "Er is iets fout gegaan bij het openen van het Project",
    "Warning(s) while opening project": "Waarschuwing(en) bij het openmaken van het Project",
    "Do you want to save changes to the \"%s\" project?": "Wil je de verandering opslaan naar het \"%s\" project?",
    "Don't Save": "Niet Opslaan",
    "You need to install Node.js® on your computer to start the bot.": "Je moet Node.js® installeren om de bot te starten.",
    "Click \"Download\" to redirect you to the Download webpage.": "Klik op \"Download\" om duurgestuurd te worden naar de Download pagina",
    "Download": "Download",
    "The URL is invalid or the service is unavailable": "De URL is ongeldig of de service is onbeschikbaar",
    "You need to set a bot token to run your bot": "Je moet een bot token invoeren om je bot te starten",
    "You need to set a bot token to generate your bot invite": "Je moet een bot token invoeren om een bot uitnodiging te genereren",
    "You need to save the project to run your bot locally": "Je moet het project opslaan om de bot lokaal te starten",
    "It's not possible to copy the bot.js file to your bot folder to run it": "Het is niet mogelijk om bot.js naar je bot map te kopieren om hem te starten",
    "The bot invite was successfully generated.": "Bot invite met succes gegenereerd",
    "Click \"Open Invite\" to redirect you to the Discord's invite webpage for your bot.": "Klik \"Open Uitnodiging\" om doorgestuurd te worden naar de Discord Invite Pagina",
    "Open Invite": "Open Uitnodiging",
    "Copy Invite": "Kopieer Uitnodiging",
    "Can't generate the bot invite": "Kan geen Bot Invite genereren",
    "Make sure the bot token is valid or try again later.": "Controleer of de Bot Token geldig is of probeer het later opnieuw.",
    "Version:": "Versie:",
    "Developer:": "Ontwikkelaar:",

    "The project path is invalid or unavailable.": "Het project pad is ongeldig of onbeschikbaar.",

    "Appearance": "Uiterlijk",
    "Workspace": "Werkruimte",
    "Backup": "Backup",
    "Language": "Taal",
    "Advanced": "Geavanceerd",
    "Activity Settings": "Activiteit Instellingen",
    "Discord RPC": "Discord RPC",

    "Dark Mode": "Donker Modus",
    "Darkens the colors in the app, which is better for your eyes in dark environments.": "Verduistert de kleuren in de app zodat het beter is voor je ogen in donkere omgevingen.",
    "System Preference": "Systeem Voorkeur",
    "Enable": "Aanzetten",
    "Disable": "Uitzetten",

    "Theme": "Thema",
    "Customize the color scheme and layout with a community-made theme.": "Pas het kleuren schema en de indeling aan met een community-gemaakte thema.",
    "Default Theme": "Standaard Thema",
    "Open Folder": "Open Map",
    "Refresh": "Vernieuwen",

    "Workspace Tabs": "Werkruimte Tabbladen",
    "Organize your open workspaces, using tabs. Make sure to close the inactive tabs.": "Organiseer je open werkruimtes met tabs. Zorg ervoor dat je alle inactieve tabs sluit.",

    "Snap Items to Grid": "Items vastmaken aan raster",
    "When moving or resizing items, align them with the grid to maintain consistency.": "Wanneer je items verplaats of vergroot, lijn ze dan uit met het raster om het netjes te houden.",

    "Maximize Block Size": "Maximale blok grootte",
    "When creating a Block that has scrollbar, maximize its size to view everything.": "Wanneer je een blok hebt met een scrollbar, maximaliseer de grootte om alles te kunnen bekijken.",

    "Oversimplify Items": "Item Simplificeren",
    "When zooming out on a big workspace, the blocks and notes will be (overly) simplified for better performance.": "Bij het uitzoomen van een grotere werkruimte zullen blokken en notities gesimplificeert worden voor betere prestaties.",

    "Animated Item Preview": "Geanimeerd itemvoorbeeld",
    "When you hover over an item in the Item Browser, it will preview the item with a 3D animation.": "Wanneer u in de Itembrowser over een item beweegt, wordt een voorbeeld van het item weergegeven met een 3D-animatie.",

    "Enable Backup": "Zet backups aan",
    "Automatically backs up your open projects, so you can open them later in case of any accident, by going to Project > Open Backup.": "Maakt automatisch back-ups van je open projecten, zodat je ze later open kan maken in het geval van een ongelukje of crash. Om open te maken ga naar Project > Open Backup.",

    "Backup Interval": "Tussentijd backup",
    "Choose how often your project will be backed up.": "Kies hoevaak er van je project een backup wordt gemaakt.",
    "1 minute": "1 minuut",
    "5 minutes": "5 minuten",
    "15 minutes": "15 minuten",
    "30 minutes": "30 minuten",
    "1 hour": "1 uur",

    "Max Backups": "Maximale back-ups",
    "Specify the maximum amount of recent backups to keep. Be aware that setting the number too high will take up a lot of storage. This action will not take effect immediately.": "Specificeer de maximale hoeveelheid van recente back-ups om te behouden. Als je dit nummer heel hoog zet gaat het veel opslag kosten. Deze actie neemt niet meteen effect.",

    "Backup raw project when opening": "Back-up van een onbewerkt project bij het openen",
    "When opening a project, backs up all its relevant files without any modifications.": "Wanneer je een project opent, maak een back-up van alle relevante bestanden zonder modificaties.",

    "Select a language": "Selecteer een taal",
    "German": "Duits",
    "English": "Engels",
    "Spanish": "Spaans",
    "French": "Frans",
    "Hungarian": "Hongaars",
    "Dutch": "Nederlands",
    "Polish": "Pools",
    "Portuguese": "Portugees",
    "Swedish": "Zweeds",
    "Czech": "Tsjechisch",
    "Russian": "Russisch",
    "Thai": "Thais",
    "Japanese": "Japans",
    "Korean": "Koreaans",
    "Most translations are made by the community and they may be incomplete, contain inaccuracies or have spelling mistakes. If you would like to help translate the app, check out our [translations repository](https://github.com/Discord-Bot-Builder/Translations).": "Meeste translaties zijn gemaakt door de community/leden van de Discord, hierdoor zijn er soms spelfouten of kloppen sommige translaties niet in de context. Als je mee wilt help met translaties verbeteren of nieuwe maken ga naar [opslagplaats voor vertalingen](https://github.com/Discord-Bot-Builder/Translations).",

    "Developer Mode": "Ontwikkelaars modus",
    "Developer Mode exposes the \"Developer\" menu with tools to help power users.": "Ontwikkelaars modus maakt het \"Ontwikkelaar\" menu beschikbaar. Dit is voor ervaren gebruikers.",

    "When selecting any Block, the \"Rename Block\" button will appear, which allows you to rename it to the desired Block (you need to know the Block's internal name). When renaming a Block, there is a risk of losing all its data.": "Bij het selecteren van een blok, komt het \"Hernoem blok\" menu naar voren, hierbij kan je hem hernoemen naar een andere blok (Hierbij moet je de blok zijn programma naam kennen anders kan hij onbeschikbaar worden en interne data verliezen).",

    "Single Action Wire": "Enkele Actie Lijn",
    "Most users do not need to make more than one wire from an output with \"Action\" type. Existing wires are not affected.": "De meeste gebruikers hoeven niet meer dan een lijn te maken vanaf een uitgang met het type \"Actie\". Bestaande lijnen worden niet beinvloed.",

    "Add starting block when creating workspace": "Voeg start-blok toe bij het creëren van werkruimte",
    "When creating a workspace, the \"bot_initialization_event\" block will be placed automatically.": "Bij het aanmaken van een werkruimte wordt het blok \"bot_initialization_event\" automatisch geplaatst.",

    "Discord Rich Presence": "Discord Rich Presence",
    "Enable DBB Rich Presence in Discord": "Zet DBB Rich Presence aan in Discord",
    "Shows in your Discord Activity that you are using Discord Bot Builder. This action may take some time.": "Toont in uw Discord-activiteit dat u Discord Bot Builder gebruikt. Deze actie kan enige tijd duren voordat het effect neemt.",

    "Show Full Info": "Toon volledige informatie",
    "Shows publicly the project name and the workspace name you are currently working on.": "Toont openbaar de projectnaam en de naam van de werkruimte waar u momenteel aan werkt.",

    "Show Status": "Toon status",
    "Shows publicly your status on your current usage of Discord Bot Builder.": "Laat publiek je status zien van je tijd op Discord Bot Builder."
}
